- ğŸ“š ë°ì´í„° ì‚¬ì´ì–¸í‹°ìŠ¤íŠ¸ì˜ ì‹¤ì „ë…¸íŠ¸, ì´ì§€ì˜, [ë¹„ì œì´í¼ë¸”ë¦­](https://bjpublic.tistory.com/) 
- ğŸŒŸ [YouTube: í†µê³„í•™ & ë°ì´í„°ê³¼í•™](https://https://www.youtube.com/channel/UC2BreMMPUd0djRpA4UEaD3Q)
- ğŸ’» [í´ë˜ìŠ¤101: ë°ì´í„° ê³¼í•™ì ì‹¤ë¬´ í”„ë¡œì íŠ¸ (ë¶„ì„+ì˜ˆì¸¡ëª¨ë¸ + AWS ìë™í™”)](https://class101.page.link/MhG4)

# 2.2 ë°ì´í„°ì—ì„œ í™•ì¸í•´ì•¼ í•  ì‚¬í•­
## 2.2.3 ê²°ì¸¡ì¹˜
2.2.3.1 ë¬´ì—‡ì´ ê²°ì¸¡ì¹˜ì¸ê°€ (Page 75)

In [1]:
# íŒë‹¤ìŠ¤ì™€ ëœë¤ ë¼ì´ë¸ŒëŸ¬ë¦¬ ë¶ˆëŸ¬ì˜¤ê¸°
import pandas as pd
import numpy as np
import random

# ê²½ê³  í‘œì‹œ ì§€ì›€ 
import warnings
warnings.filterwarnings('ignore')

# ì„ì˜ ìˆ«ì ì‹œë“œ ì„¤ì •
random.seed(20)
np.random.seed(21)

# ê³ ê°ID ë°°ì—´ 
# 100000(í¬í•¨)ì—ì„œ 200000(ë¶ˆí¬í•¨) ìˆ˜ ì¤‘ ë¬´ì‘ìœ„ë¡œ 11ê°œ ì •ìˆ˜ê°’ ì¶”ì¶œ

user_id = np.random.randint(100000, 200000, 11)
food_list = ['ìŒë£Œ', 'ì±„ì†Œ', 'ê°„ì‹', 3, 'ê³¼ì¼', '', 'ìº”', 'ë„ì„œ', '-30%', 'ë¬´ë£Œë°°ì†¡', None]

#ê¸°ì¡´ì— ë§Œë“  user_idë¥¼ ê³ ê°_IDì´ë€ ì—´ë¡œ, food_listëŠ” ì‹í’ˆì´ë€ ì—´ë¡œ ë³€í™˜í•´ ë°ì´í„°í”„ë ˆì„ ìƒì„±
df = pd.DataFrame({ 
                    'ê³ ê°ID': user_id,
                    'ì‹í’ˆ': food_list
                  })
df

      ê³ ê°ID    ì‹í’ˆ
0   180841    ìŒë£Œ
1   170863    ì±„ì†Œ
2   171480    ê°„ì‹
3   108964     3
4   181968    ê³¼ì¼
5   163856
6   142104     ìº”
7   188764    ë„ì„œ
8   145666  -30%
9   196767  ë¬´ë£Œë°°ì†¡
10  164241  None

### 2.2.3.2 ê²°ì¸¡ì¹˜ë¥¼ ì–´ë–»ê²Œ í‘œí˜„í•  ê²ƒì¸ê°€ (page 78)

In [2]:
x = np.nan
print('np.nan íƒ€ì…:', type(x))

y = None
print('None íƒ€ì…:', type(y))

np.nan íƒ€ì…: <class 'float'>
None íƒ€ì…: <class 'NoneType'>

In [3]:
print('xê°’ì—ì„œ is, == í™•ì¸')
print(x is np.nan)
print(x == np.nan)
print('\nyê°’ì˜ is, == í™•ì¸')
print(y is None)
print(y == None)

xê°’ì—ì„œ is, == í™•ì¸
True
False

yê°’ì˜ is, == í™•ì¸
True
True

In [4]:
# df_nan ë°ì´í„°í”„ë ˆì„ ë§Œë“¤ê¸°
df_nan = pd.DataFrame([1, 2, np.nan], columns=["A"]) 
print(df_nan.dtypes)
df_nan

A    float64
dtype: object

     A
0  1.0
1  2.0
2  NaN

In [5]:
# ë¹„êµ ì—°ì‚°ìë¥¼ ì´ìš©í•´ np.nan ì œê±°í•˜ê¸°
df_nan[df_nan["A"] != np.nan]

     A
0  1.0
1  2.0
2  NaN

In [6]:
# ê²°ì¸¡ì¹˜ë¥¼ í™•ì¸í•˜ëŠ” í•¨ìˆ˜ë¥¼ í†µí•´ ê²°ì¸¡ì¹˜ ì œê±°í•˜ê¸°
df_nan[~df_nan["A"].isnull()]

     A
0  1.0
1  2.0

In [7]:
# id_food_dict ë”•ì…”ë„ˆë¦¬ ìƒì„±
id_food_dict = {1: 'ìŒë£Œ', 2: np.nan, 3: None}

print('key 1 í•´ë‹¹í•˜ëŠ” value:', id_food_dict.get(1))
print('key 2 í•´ë‹¹í•˜ëŠ” value:', id_food_dict.get(2))
print('key 3 í•´ë‹¹í•˜ëŠ” value:', id_food_dict.get(3))
print('keyê°€ ì—†ëŠ” ê²½ìš°:', id_food_dict.get(4))

key 1 í•´ë‹¹í•˜ëŠ” value: ìŒë£Œ
key 2 í•´ë‹¹í•˜ëŠ” value: nan
key 3 í•´ë‹¹í•˜ëŠ” value: None
keyê°€ ì—†ëŠ” ê²½ìš°: None

In [8]:
# defë¥¼ ì´ìš©í•´ í•¨ìˆ˜ë¥¼ ë§Œë“¤ ë•Œ return ê°’ì´ ì •ì˜ë˜ì§€ ì•Šì€ ê²½ìš°
def get_add(x, y):
    print("í•¨ìˆ˜ ì‹œì‘")
    print(x+y)
    print("í•¨ìˆ˜ ë")

    
print(get_add(3,4))

í•¨ìˆ˜ ì‹œì‘
7
í•¨ìˆ˜ ë
None

In [9]:
def get_add(x, y):
    print("í•¨ìˆ˜ ì‹œì‘")
    print(x+y)
    print("í•¨ìˆ˜ ë")
    return x+y

print(get_add(3,4))

í•¨ìˆ˜ ì‹œì‘
7
í•¨ìˆ˜ ë
7

In [10]:
df

      ê³ ê°ID    ì‹í’ˆ
0   180841    ìŒë£Œ
1   170863    ì±„ì†Œ
2   171480    ê°„ì‹
3   108964     3
4   181968    ê³¼ì¼
5   163856
6   142104     ìº”
7   188764    ë„ì„œ
8   145666  -30%
9   196767  ë¬´ë£Œë°°ì†¡
10  164241  None

In [11]:
df.dtypes

ê³ ê°ID     int64
ì‹í’ˆ      object
dtype: object

### <ê·¸ë¦¼ 2-8>ì˜ ë°ì´í„° (page 84)

In [12]:
# í•„ìš”í•œ ë¼ì´ë¸ŒëŸ¬ë¦¬ ë¶ˆëŸ¬ì˜¤ê¸°
import numpy as np
import pandas as pd
import random

# ì„ì˜ ìˆ«ì ì‹œë“œ ì„¤ì •
random.seed(20) # ì„ì˜ë¡œ 20 ì§€ì • 
np.random.seed(21) # ì„ì˜ë¡œ 21 ì§€ì •

# ê³ ê°ID ë°°ì—´ 
# 100000ê³¼200000ì‚¬ì´ ëœë¤í•œ ì •ìˆ˜ 10ê°œë¥¼ ë½‘ì•„ ë°°ì—´ë¡œ ë°˜í™˜í•œ ê²ƒì„ user_idë¼ ì§€ì •
# ì´ë•Œ, 100000 í¬í•¨í•˜ë©° 200000 í¬í•¨í•˜ì§€ ì•ŠìŒ
user_id = np.random.randint(100000, 200000, 10)

# êµ¬ë§¤ ê°€ê²© ë¦¬ìŠ¤íŠ¸ 
# 100ì—ì„œ 1000 ì‚¬ì´ ê°’ì—ì„œ ë¬´ì‘ìœ„ë¡œ 10ê°œë¥¼ ë½‘ì•„ ë¦¬ìŠ¤íŠ¸ë¡œ ë°˜í™˜ (1000 ë¶ˆí¬í•¨)
price_list = random.sample(range(100, 1000), 10)
# ê° ìš”ì†Œì— 1000ì„ ê³±í•œ ë’¤ $ë¥¼ ë¶™ì—¬ ë¬¸ìì—´ ë¦¬ìŠ¤íŠ¸ë¡œ ë³€í™˜
price_list = ['$' + str(x*1000) for x in price_list]

# í• ì¸ ê¸ˆì•¡ ë¦¬ìŠ¤íŠ¸  
# 100ì—ì„œ 500 ì‚¬ì´ ê°’ì—ì„œ ë¬´ì‘ìœ„ë¡œ 10ê°œë¥¼ ë½‘ì•„ ë¦¬ìŠ¤íŠ¸ë¡œ ë°˜í™˜ (500 ë¶ˆí¬í•¨)
reduce_price_list = random.sample(range(100, 500), 10)

# ê° ìš”ì†Œì— 10ì„ ê³±í•œ ë’¤ $ë¥¼ ë¶™ì—¬ ë¬¸ìì—´ ë¦¬ìŠ¤íŠ¸ë¡œ ë³€í™˜
reduce_price_list = ['$' + str(x*10) for x in reduce_price_list]

# VIP ì—¬ë¶€ ë°°ì—´
# YëŠ” 0.3ì˜ ë½‘í í™•ë¥ ë¡œ, Nì€ 0.7ì˜ ë½‘í í™•ë¥ ë¡œ 10ê°œì˜ Yì™€ Nìœ¼ë¡œ êµ¬ì„±ëœ ë°°ì—´ ë°˜í™˜
vip_array = np.random.choice(["Y", "N"], size=10, p=[0.3, 0.7])

# ì„ì˜ ë°ì´í„° ë§Œë“¤ê¸° 
df = pd.DataFrame({
                    'ê³ ê°ID': user_id, 
                    'êµ¬ë§¤ë‚ ì§œ': pd.Timestamp('20210331'),
                    'êµ¬ë§¤ê°€ê²©': price_list,
                    'í• ì¸ê¸ˆì•¡': reduce_price_list,
                    'VIP': vip_array
                  })
df

     ê³ ê°ID       êµ¬ë§¤ë‚ ì§œ     êµ¬ë§¤ê°€ê²©   í• ì¸ê¸ˆì•¡ VIP
0  180841 2021-03-31  $840000  $2670   Y
1  170863 2021-03-31  $802000  $3930   N
2  171480 2021-03-31  $905000  $1860   N
3  108964 2021-03-31  $884000  $1130   N
4  181968 2021-03-31  $254000  $3100   Y
5  163856 2021-03-31  $366000  $3080   N
6  142104 2021-03-31  $790000  $1380   Y
7  188764 2021-03-31  $750000  $1520   N
8  145666 2021-03-31  $969000  $1640   N
9  196767 2021-03-31  $203000  $2630   N

In [13]:
df.dtypes

ê³ ê°ID             int64
êµ¬ë§¤ë‚ ì§œ    datetime64[ns]
êµ¬ë§¤ê°€ê²©            object
í• ì¸ê¸ˆì•¡            object
VIP             object
dtype: object

In [14]:
df["í• ì¸ê¸ˆì•¡"] = df["í• ì¸ê¸ˆì•¡"].str.replace("$", "").astype(int)
df

     ê³ ê°ID       êµ¬ë§¤ë‚ ì§œ     êµ¬ë§¤ê°€ê²©  í• ì¸ê¸ˆì•¡ VIP
0  180841 2021-03-31  $840000  2670   Y
1  170863 2021-03-31  $802000  3930   N
2  171480 2021-03-31  $905000  1860   N
3  108964 2021-03-31  $884000  1130   N
4  181968 2021-03-31  $254000  3100   Y
5  163856 2021-03-31  $366000  3080   N
6  142104 2021-03-31  $790000  1380   Y
7  188764 2021-03-31  $750000  1520   N
8  145666 2021-03-31  $969000  1640   N
9  196767 2021-03-31  $203000  2630   N

In [15]:
# ë¦¬ìŠ¤íŠ¸ì— ìˆëŠ” ì—´ë§ˆë‹¤ 0.25ë§Œí¼ì˜ í–‰ì„ ìƒ˜í”Œ ì¸ë±ìŠ¤ë¥¼ ì¶”ì¶œí•´ í•´ë‹¹ ì¸ë±ìŠ¤ì— ìˆëŠ” ê°’ì„ np.nanìœ¼ë¡œ ë³€í™˜
for col in ['êµ¬ë§¤ë‚ ì§œ', 'êµ¬ë§¤ê°€ê²©', 'í• ì¸ê¸ˆì•¡', 'VIP']:
    df.loc[df.sample(frac=0.25).index, col] = np.nan
df

     ê³ ê°ID       êµ¬ë§¤ë‚ ì§œ     êµ¬ë§¤ê°€ê²©    í• ì¸ê¸ˆì•¡  VIP
0  180841 2021-03-31  $840000  2670.0    Y
1  170863        NaT      NaN  3930.0    N
2  171480 2021-03-31  $905000  1860.0  NaN
3  108964 2021-03-31  $884000     NaN    N
4  181968        NaT  $254000  3100.0    Y
5  163856 2021-03-31  $366000     NaN    N
6  142104 2021-03-31  $790000  1380.0    Y
7  188764 2021-03-31      NaN  1520.0  NaN
8  145666 2021-03-31  $969000  1640.0    N
9  196767 2021-03-31  $203000  2630.0    N

In [16]:
df.dtypes

ê³ ê°ID             int64
êµ¬ë§¤ë‚ ì§œ    datetime64[ns]
êµ¬ë§¤ê°€ê²©            object
í• ì¸ê¸ˆì•¡           float64
VIP             object
dtype: object

In [17]:
# ë¦¬ìŠ¤íŠ¸ì— ìˆëŠ” ì—´ë§ˆë‹¤ 0.25ë§Œí¼ì˜ í–‰ì„ ìƒ˜í”Œ ì¸ë±ìŠ¤ë¥¼ ì¶”ì¶œí•´ í•´ë‹¹ ì¸ë±ìŠ¤ì— ìˆëŠ” ê°’ì„ Noneìœ¼ë¡œ ë³€í™˜
for col in ['êµ¬ë§¤ë‚ ì§œ', 'êµ¬ë§¤ê°€ê²©', 'í• ì¸ê¸ˆì•¡', 'VIP']:
    df.loc[df.sample(frac=0.25).index, col] = None
df

     ê³ ê°ID       êµ¬ë§¤ë‚ ì§œ     êµ¬ë§¤ê°€ê²©    í• ì¸ê¸ˆì•¡   VIP
0  180841 2021-03-31  $840000  2670.0     Y
1  170863        NaT      NaN  3930.0     N
2  171480 2021-03-31  $905000  1860.0   NaN
3  108964        NaT  $884000     NaN     N
4  181968        NaT  $254000  3100.0     Y
5  163856        NaT  $366000     NaN  None
6  142104 2021-03-31     None     NaN  None
7  188764 2021-03-31      NaN  1520.0   NaN
8  145666 2021-03-31  $969000     NaN     N
9  196767 2021-03-31     None  2630.0     N

In [18]:
df.isnull().sum()

ê³ ê°ID    0
êµ¬ë§¤ë‚ ì§œ    4
êµ¬ë§¤ê°€ê²©    4
í• ì¸ê¸ˆì•¡    4
VIP     4
dtype: int64

In [19]:
# dfì™€ ë˜‘ê°™ì€ ë°ì´í„°í”„ë ˆì„ì„ df_ex1ì— ì €ì¥ 
df_ex1 = df.copy()

# ê° ì—´ë§ˆë‹¤ replaceë¥¼ ì´ìš©í•´ np.nanì„ Noneê°’ìœ¼ë¡œ ë³€í™˜ 
for col in ["êµ¬ë§¤ë‚ ì§œ", "êµ¬ë§¤ê°€ê²©", "í• ì¸ê¸ˆì•¡", "VIP"]:
    df_ex1[col] = df_ex1[col].replace(np.nan, None)
    
df_ex1

     ê³ ê°ID       êµ¬ë§¤ë‚ ì§œ     êµ¬ë§¤ê°€ê²©    í• ì¸ê¸ˆì•¡ VIP
0  180841 2021-03-31  $840000  2670.0   Y
1  170863 2021-03-31  $840000  3930.0   N
2  171480 2021-03-31  $905000  1860.0   N
3  108964 2021-03-31  $884000  1860.0   N
4  181968 2021-03-31  $254000  3100.0   Y
5  163856 2021-03-31  $366000  3100.0   Y
6  142104 2021-03-31  $366000  3100.0   Y
7  188764 2021-03-31  $366000  1520.0   Y
8  145666 2021-03-31  $969000  1520.0   N
9  196767 2021-03-31  $969000  2630.0   N

In [20]:
# dfì™€ ë˜‘ê°™ì€ ë°ì´í„°í”„ë ˆì„ì„ df_ex2ì— ì €ì¥ 
df_ex2 = df.copy()

# whereêµ¬ë¬¸ì„ ì´ìš©í•´ ê²°ì¸¡ì¹˜ë¥¼ Noneê°’ìœ¼ë¡œ ë³€í™˜ 
df_ex2 = df_ex2.where(pd.notnull(df_ex2), None)
df_ex2

     ê³ ê°ID       êµ¬ë§¤ë‚ ì§œ     êµ¬ë§¤ê°€ê²©    í• ì¸ê¸ˆì•¡   VIP
0  180841 2021-03-31  $840000  2670.0     Y
1  170863        NaT     None  3930.0     N
2  171480 2021-03-31  $905000  1860.0  None
3  108964        NaT  $884000     NaN     N
4  181968        NaT  $254000  3100.0     Y
5  163856        NaT  $366000     NaN  None
6  142104 2021-03-31     None     NaN  None
7  188764 2021-03-31     None  1520.0  None
8  145666 2021-03-31  $969000     NaN     N
9  196767 2021-03-31     None  2630.0     N

In [21]:
df_ex2.dtypes

ê³ ê°ID             int64
êµ¬ë§¤ë‚ ì§œ    datetime64[ns]
êµ¬ë§¤ê°€ê²©            object
í• ì¸ê¸ˆì•¡           float64
VIP             object
dtype: object

âš  ì €ì‘ê¶Œ: Copyright 2022. (ì´ì§€ì˜) all rights reserved. 
ë³¸ ìë£ŒëŠ” ì €ì‘ê¶Œë²•ì— ì˜í•˜ì—¬ ë³´í˜¸ë°›ëŠ” ì €ì‘ë¬¼ë¡œì„œ ì´ì— ëŒ€í•œ ë¬´ë‹¨ ë³µì œ ë° ë°°í¬ë¥¼ ì›ì¹™ì ìœ¼ë¡œ ê¸ˆí•©ë‹ˆë‹¤. í˜‘ì˜ ì—†ì´ ë°°í¬í•˜ê±°ë‚˜ ë¬´ë‹¨ìœ¼ë¡œ ì‚¬ìš©í•  ê²½ìš° ì €ì‘ê¶Œë²• ì œ136ì¡°, 137ì¡°, 138ì¡° ìœ„ë°˜ìœ¼ë¡œ ì‚¬ì „ ê²½ê³  ì—†ì´ ì†í•´ë°°ìƒ ì²­êµ¬ ë“± ë¯¼,í˜•ì‚¬ìƒì˜ ì±…ì„ê³¼ ì²˜ë²Œì„ ë°›ì„ ìˆ˜ ìˆìŠµë‹ˆë‹¤.